Revit 2024 API
STLExportOptions Class
 The export options used by exporting STL format file.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021.1
Syntax
C#
public class STLExportOptions : BIMExportOptions
Visual Basic
Public Class STLExportOptions _
	Inherits BIMExportOptions
Visual C++
public ref class STLExportOptions : public BIMExportOptions
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BIMExportOptions
 Autodesk.Revit.DB.STLExportOptions
See Also
STLExportOptions Members
Autodesk.Revit.DB Namespace